In [5]:
import pandas as pd
import numpy as np

## Crating a dataframe

In [6]:
# Array with numpy
data = np.array([[1,4],[2,6],[3,6]])

In [8]:
# Dataframe with pandas
df = pd.DataFrame(data, index=['row1','row2','row3'],columns=['col1','col2'])

In [9]:
df

      col1  col2
row1     1     4
row2     2     6
row3     3     6

## Creating a dataframe from a dictionary

In [10]:
states = ['California', 'Texas', 'Florida']
population = [39613493,29730311,21944577]

In [11]:
dictStates = {'States':states,'Population':population}

In [12]:
df_population = pd.DataFrame(dictStates)

In [13]:
df_population

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida    21944577

## Creating a dataframe from  a csv file

In [14]:
df_exams = pd.read_csv('StudentsPerformance.csv')

In [15]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75